Dlubal.DynamPro.DLC_RSAssignment
Dynamic load case - response spectrum assignment

Dlubal.DynamPro.DLC_RSAssignment.EnableDirX
Enable direction X

Dlubal.DynamPro.DLC_RSAssignment.ResponseSpectrumX
Response spectrum in direction X

Dlubal.DynamPro.DLC_RSAssignment.ResponseSpectrumXFactor
Factor for response spectrum in direction X

Dlubal.DynamPro.DLC_RSAssignment.EnableDirY
Enable direction Y

Dlubal.DynamPro.DLC_RSAssignment.ResponseSpectrumY
Response spectrum in direction Y

Dlubal.DynamPro.DLC_RSAssignment.ResponseSpectrumYFactor
Factor for response spectrum in direction Y

Dlubal.DynamPro.DLC_RSAssignment.EnableDirZ
Enable direction Z

Dlubal.DynamPro.DLC_RSAssignment.ResponseSpectrumZ
Response spectrum in direction Z

Dlubal.DynamPro.DLC_RSAssignment.ResponseSpectrumZFactor
Factor for response spectrum in direction Z

Dlubal.DynamPro.DLC_RSAssignment.RotationAlpha
Rotation of ax and ay about Z axis [rad]